---
type: ElementCategoryFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementCategoryFilter

`Autodesk.Revit.DB.ElementCategoryFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementCategoryFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | CategoryId | 2011 | `public ElementId CategoryId { get ; }` |